---
type: EffectInstance
namespace: Autodesk.Revit.DB.DirectContext3D
version: 2024
members: 12
tags: [revit-api, class]
---

# EffectInstance

`Autodesk.Revit.DB.DirectContext3D.EffectInstance` · Revit 2024 · 12 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | EffectInstance | 2017 | `public EffectInstance ( VertexFormatBits vertexFormatBits )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsValid | 2017 | `public bool IsValid ()` |
| Method | MatchesFormat | 2017 | `public bool MatchesFormat ( VertexFormat vertexFormat )` |
| Method | SetAmbientColor | 2017 | `public void SetAmbientColor ( Color color )` |
| Method | SetColor | 2017 | `public void SetColor ( Color color )` |
| Method | SetDiffuseColor | 2017 | `public void SetDiffuseColor ( Color color )` |
| Method | SetEmissiveColor | 2017 | `public void SetEmissiveColor ( Color color )` |
| Method | SetGlossiness | 2017 | `public void SetGlossiness ( double glossiness )` |
| Method | SetSpecularColor | 2017 | `public void SetSpecularColor ( Color color )` |
| Method | SetTransparency | 2017 | `public void SetTransparency ( double transparency )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |